//Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.
let i = 1;
while (i <= 10) {
    console.log(i);
    i += 1;
}



//Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.
for (let a = 2; a <= 20; a += 1) {
    if (a % 2 !== 0) {
        continue;
    }
    console.log(a);
}


//Вивести в консоль таблицю множення числа 7 за допомогою циклу for.
for (let x = 0; x <= 10; x += 1) {
    console.log(`7 x ${x} = ${7 * x}`);
}




//Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
let n = Number(prompt("Введіть число"));
for (let i = 1; i <= 10; i += 1) {
    if (i >= n) {
        break;
    }
    console.log(i);
}




//За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
let i = 1;
while (i <= 20) {
    if (i % 3 === 0) {
        i += 1;
        continue;
    }
    console.log(i);
    i += 1;
}

